# RevitLinkFileName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCImportOptions..::..RevitLinkFileName Property
IFCImportOptions Class See Also
---
The full path of the intermediate Revit file created during a previous link action. This is used during "Reload From" to determine the path to the previous generated Revit file.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string RevitLinkFileName { get; set; }
```

Visual Basic
---
```text
Public Property RevitLinkFileName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ RevitLinkFileName {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace